app/views/admin/dashboard.html.erb

          <span class="comments-count">
          <%= PostView.where(post: post).count %> vue(s)
---
SELECT COUNT(*) FROM "post_views" WHERE "post_views"."post_id" = $1  [["post_id", 3]]