app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "content_html") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Test"], ["user_id", 2], ["created_at", "2019-02-17 20:06:51.679650"], ["updated_at", "2019-02-17 20:06:51.679650"], ["content_html", "<p>Test</p>"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 AND "posts"."confirmed" = $2 ORDER BY created_at DESC LIMIT $3  [["id", 2], ["confirmed", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by(id: params[:id], confirmed: 1)
    render_404 and return unless @post && User.find_by(id: @post.user_id)

SELECT  "post_views".* FROM "post_views" WHERE "post_views"."post_id" = $1 AND "post_views"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "post_views" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["post_id", 1], ["created_at", "2019-02-16 19:11:15.380230"], ["updated_at", "2019-02-16 19:11:15.380230"]]
UPDATE "users" SET "posts_count" = COALESCE("posts_count", 0) + 1 WHERE "users"."id" = ?  [["id", 1]]
---
  def set_view
    @post_view = PostView.find_by(post: @post, user: current_user)
    if(!@post_view)
      @post_view = PostView.new
      @post_view.post = @post
      @post_view.user = current_user
      @post_view.save